tap "1password/tap"
tap "bufbuild/buf"
tap "mdogan/zulu"
tap "monzo/tap", "git@github.com:monzo/tap.git"

# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Open source programming language to build simple/reliable/efficient software
brew "go@1.23", link: true
# Best command-line tool to install and switch between multiple versions of Xcode
brew "xcodes"
# Template-free customization of Kubernetes YAML manifests
brew "monzo/tap/kustomize@3.7.0"
# Protocol buffers (Google's data interchange format)
brew "monzo/tap/protobuf@3.13.0"
# Kubernetes kubectl 1.21 Command Line Interface
brew "monzo/tap/kubectl@1.21"
# JavaScript package manager
brew "yarn"
# Official Amazon AWS command-line interface
brew "awscli"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"

# Command-line interface for 1Password
cask "1password-cli"
# Command-line tools for building and debugging Android apps
cask "android-commandlinetools"
# Android SDK component
cask "android-platform-tools"
# Tools for building Android applications
cask "android-studio"
# Tools to protect your files
cask "gpg-suite-no-mail"
# HTTP debugging proxy
cask "proxyman"
cask "zulu-jdk19"